---
kind: method
id: M:Autodesk.Revit.DB.RoutingConditions.Dispose
source: html/3b47a813-1bde-865b-98ce-330caaebc48a.htm
---
# Autodesk.Revit.DB.RoutingConditions.Dispose Method

Releases all resources used by the RoutingConditions

## Syntax (C#)
```csharp
public void Dispose()
```